Revit 2027 API
WorksharingDisplaySettings.GetGraphicOverrides(ModelUpdatesStatus) Method
 Returns the graphic overrides assigned to a particular model update status.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksharingDisplayGraphicSettings GetGraphicOverrides(
	ModelUpdatesStatus statusInCentral
)
Public Function GetGraphicOverrides (
	statusInCentral As ModelUpdatesStatus
) As WorksharingDisplayGraphicSettings
public:
WorksharingDisplayGraphicSettings^ GetGraphicOverrides(
	ModelUpdatesStatus statusInCentral
)
member GetGraphicOverrides :
        statusInCentral : ModelUpdatesStatus -> WorksharingDisplayGraphicSettings
Parameters
statusInCentral ModelUpdatesStatus
 The model update status of interest.
Return Value
WorksharingDisplayGraphicSettings
 Returns the graphic overrides assigned to the model update status.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
WorksharingDisplaySettings Class
GetGraphicOverrides Overload
Autodesk.Revit.DB Namespace